IDENTIFICATION DIVISION.
PROGRAM-ID. CNT003.
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 CNT PIC 9(5) VALUE 0.
    01 SYOU PIC 9(5) VALUE 0.
    01 AMARI PIC 9(2) VALUE 0.
    01 WTIME.
      03 HH PIC 9(2).
      03 MM PIC 9(2).
      03 SS PIC 9(2).
      03 MS PIC 9(2).
    01 STIME PIC 9(5) VALUE 0.
    01 ETIME PIC 9(5) VALUE 0.
    01 XTIME PIC 9(5) VALUE 0.
PROCEDURE DIVISION.
  ACCEPT WTIME FROM TIME.

  PERFORM UNTIL CNT = 1000
    ADD 1 TO CNT
    DIVIDE CNT BY 10 GIVING SYOU REMAINDER AMARI
    IF AMARI = 0
      THEN
        DISPLAY CNT
      ELSE
        CONTINUE
    END-IF
  END-PERFORM.

  DISPLAY "==START== " HH ":" MM ":" SS
  COMPUTE STIME = HH * 60 * 60 + MM * 60 + SS.
  ACCEPT WTIME FROM TIME.
  DISPLAY "==FINISH== " HH ":" MM ":" SS
  COMPUTE ETIME = HH * 60 * 60 + MM * 60 + SS.

  COMPUTE XTIME = ETIME - STIME.
  DISPLAY "TIME : " XTIME "sec".
  STOP RUN.
