IDENTIFICATION DIVISION.
PROGRAM-ID. CNT001.
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 CNT PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
    PERFORM VARYING CNT FROM 0 BY 5 UNTIL CNT > 100
    DISPLAY "COUNT = " CNT
  END-PERFORM.
  STOP RUN.
