IDENTIFICATION DIVISION.
PROGRAM-ID. CNT004.
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 CNT PIC 9(5) VALUE 0.
    01 CNT_MAX PIC 9(5) VALUE 0.
    01 SYOU PIC 9(5) VALUE 0.
    01 AMARI PIC 9(5) VALUE 0.
PROCEDURE DIVISION.
A.
  MOVE 0 TO CNT.
  DISPLAY "enter CNT".
  ACCEPT CNT_MAX.
  IF CNT_MAX NOT = 9999
   THEN
  PERFORM UNTIL CNT > CNT_MAX
    DIVIDE CNT BY 100 GIVING SYOU REMAINDER AMARI
    IF AMARI = 0
      THEN
        DISPLAY CNT
      ELSE
        CONTINUE
    END-IF
    ADD 1 TO CNT
  END-PERFORM
  GO TO A
  ELSE
    CONTINUE
  END-IF.
  STOP RUN.
