IDENTIFICATION DIVISION.
PROGRAM-ID. TEST-COBOL.
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 VAR1 PIC 9(3) VALUE 0.
    01 VAR2 PIC 9(3) VALUE 0.
    01 VAR3 PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
  MOVE 10 TO VAR1.
  DIVIDE VAR1 BY 3 GIVING VAR3 REMAINDER VAR2.
  DISPLAY VAR1.
  DISPLAY VAR2.
  STOP RUN.
